[
    {
      "name": "Three Trios Game",
      "description": "Developed during my Object-Oriented Design course, this game showcases advanced object-oriented programming\nconcepts and practices. It incorporates design patterns such as decorators, adapters, and strategies, while adhering to the MVC\n(Model-View-Controller) architecture.",
      "languages": "Java, OOP, JUnit",
      "link": "https://github.com/staysgt/ThreeTriosGame",
      "image": "ThreeTrios.png"
    },

      {
        "name": "Air Quality - Maching Learning",
        "description": "Developed a machine learning model in Python to analyze the correlation between weather conditions and air quality across major US cities. Utilized APIs for data collection, performed extensive data cleaning (Pandas, NumPy), and created visualizations (Matplotlib) to enhance interpretability. Implemented and compared multiple ML models (Scikit-Learn) to optimize accuracy.",
        "languages": "Python, NumPy, Matplotlib, Scikit-Learn",
        "image": "AirQuality.png"
      },

      {
        "name": "Image Compression",
        "description": "Developed a tool that compresses PNG images by removing seams of pixels with the lowest energy, improving image processing efficiency and maintaining visual integrity.",
        "languages": "Java, JUnit",
        "link":"https://github.com/staysgt/Image-Compression",
        "image": "ImageCompression.png"
      },

      {
        "name": "SAIL - HackMIT '25",
        "description": "Developed an educational platform using React and Supabase designed to reduce student dependency on AI tools through interactive comprehension assessments. Integrated Claude AI and Google Cloud Speech-to-Text APIs to provide real-time evaluation of student understanding and generate actionable feedback for educators, promoting deeper learning engagement.",
        "languages": "React, Javascript, Prisma, Supabase, Claude API, Google Cloud Speech-to-Text",
        "link":"https://github.com/lewisabel/hackMIT-2025",
        "image": "SAIL.png"
      },
      {
        "name": "CopOrNot - HackHarvard '25",
        "description": "Developed a crowdsourcing mobile application that allows users to report and track police presence at MBTA train stations in real-time. The app calculates probability scores based on user submissions and provides historical data visualization, enhancing commuter safety awareness and providing peace of mind when navigating unfamiliar transit locations.",
        "languages": "React Native, Expo, JavaScript, Google Maps API, MBTA API",
        "link":"https://github.com/rileydrcelik/co-p-or--not",
        "image": "CopOrNot.png"
      },
      {
        "name": "Jean Sizing Converter",
        "description": "Developed a full stack mobile app to help fix women's jean sizing inconsistencies, despite sizing differences among brands.",
        "languages": "React Native, Expo, Typescript, Firebase API, Postman, Vitest, Next.js",
        "link":"",
        "image": "JeanSizing.png"
      },
      {
        "name": "Word Game",
        "description": "Developed a terminal playable word game in Java. Implements binary search, object oriented design.",
        "languages": "Java, JUnit, OOP",
        "link":"",
        "image": "WordGame.png"
      }


  ]

  